art_sharing/app/controllers/artwork_shares_controller.rb

    def create
        share = ArtworkShare.new(artwork_share_params)

        if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 2], ["created_at", "2020-11-26 18:43:11.127915"], ["updated_at", "2020-11-26 18:43:11.127915"]]