ninety_nine_cats/app/views/cats/show.html.erb

    <ul>
        <% cat_rental_requests = CatRentalRequest.where(cat_id: @cat.id).includes(:user)%>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 3]]