goalsetting_app/app/views/goals/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    <li><%= comment.text %>
    by <%= User.find_by(id: comment.author_id).email %>