ninety_nine_cats/app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
        <option disable selected>- select a cat-</option>
        <% Cat.all.each do |cat| %>