music_app/app/controllers/albums_controller.rb

    def new
        @band = Band.find_by(id: params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        album = Album.new(album_params)

        if album.save
---
INSERT INTO "albums" ("title", "band_id", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Whiche"], ["band_id", 1], ["year", 2005], ["live", true], ["created_at", "2020-12-20 01:12:33.808331"], ["updated_at", "2020-12-20 01:12:33.808331"]]

    def destroy
        album = Album.find_by(id: params[:id])
        album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 2]]