music_app/app/controllers/bands_controller.rb

    def create
        band = Band.new(band_params)

        if band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Charles City"], ["created_at", "2020-12-18 23:26:41.434059"], ["updated_at", "2020-12-18 23:26:41.434059"]]

    def destroy
        band = Band.find_by(id: params[:id])
        band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]