music_app/app/controllers/notes_controller.rb

INSERT INTO "notes" ("user_id", "track_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["track_id", 1], ["text", "Hello!"], ["created_at", "2020-12-21 17:55:19.510248"], ["updated_at", "2020-12-21 17:55:19.510248"]]
---
    def create
        note = Note.new(note_params)
        note.user_id = current_user.id

        if note.save