music_app/app/controllers/tracks_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def new
        @album = Album.find_by(id: params[:album_id])

INSERT INTO "tracks" ("title", "album_id", "ord", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Dolphin"], ["album_id", 6], ["ord", 1], ["lyrics", "Walk to me"], ["created_at", "2020-12-21 16:49:33.940140"], ["updated_at", "2020-12-21 16:49:33.940140"]]
---
    def create
        track = Track.new(track_params)

        if track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @track = Track.find_by(id: params[:id])