ninety_nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "Rolls around a lot!"], ["updated_at", "2020-12-06 17:29:45.512166"], ["id", 5]]
---
    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)