ninety_nine_cats/app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2020-12-12 22:08:22.281562"], ["id", 2]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2020-12-22' OR end_date > '2020-12-15') AND (status = 'PENDING')  [["id", 2], ["cat_id", 1]]
---
    def approve!
        transaction do
            self.status = 'APPROVED'
            self.save!
            overlapping_pending_requests.each {|req| req.deny!}

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-12-08 02:18:39.417044"], ["id", 1]]
---
    def deny!
        self.status = 'DENIED'
        self.save!