ninety_nine_cats/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "bobe22"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        user = User.find_by(user_name: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "H28EXtd5zRHFu1qAFw80vw"], ["updated_at", "2020-12-12 04:26:48.905493"], ["id", 2]]
---
    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save