ninety_nine_cats/app/models/user.rb

    def self.find_by_credentials(username, password)
        user = User.find_by(user_name: username)
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "redale"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "FyBw4Mq7rRypaTjY0OsByg"], ["updated_at", "2020-12-12 22:17:31.474346"], ["id", 3]]