goalsetting_app/app/views/users/index.html.erb

<ul>
    <% User.last(20).each do |user|%>
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 20]]