goalsetting_app/app/views/users/show.html.erb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 3]]
---
<ul>
    <% @user.goals.each do |goal| %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    <li><%= comment.text %>
    by <%= User.find_by(id: comment.author_id).email %>