goalsetting_app/app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "author_id", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["text", "Quick trick!"], ["author_id", 3], ["commentable_id", 2], ["commentable_type", "Goal"], ["created_at", "2021-01-12 23:12:43.183377"], ["updated_at", "2021-01-12 23:12:43.183377"]]
---
    def create
        comment = Comment.new(comment_params)
        comment.author_id = current_user.id

        if comment.save