goalsetting_app/app/controllers/goals_controller.rb

    def create
        goal = Goal.new(goal_params)
        goal.user_id = current_user.id

        if goal.save
---
INSERT INTO "goals" ("title", "description", "user_id", "completion_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def show
        @goal = Goal.find_by(id: params[:id])
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def destroy
        goal = Goal.find_by(id: params[:id])
        user_id = goal.user_id
        goal.destroy
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 1]]