redditclone/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)

        @comment.author_id = current_user.id

        if @comment.save
---
INSERT INTO "comments" ("author_id", "post_id", "content", "parent_comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author_id", 4], ["post_id", 3], ["content", "reply to main comment!"], ["parent_comment_id", 1], ["created_at", "2021-01-31 22:42:25.659635"], ["updated_at", "2021-01-31 22:42:25.659635"]]