redditclone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "author_id", "url", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Dawn of Time"], ["author_id", 4], ["url", "widfdfsjk"], ["content", "jfkdlsjfldjklkf"], ["created_at", "2021-01-30 19:51:58.040732"], ["updated_at", "2021-01-30 19:51:58.040732"]]
---
    def create
        @post = Post.new(post_params)

        @post.author_id = current_user.id

        if @post.save

INSERT INTO "votes" ("user_id", "value", "votable_id", "votable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 4], ["value", 1], ["votable_id", 3], ["votable_type", "Post"], ["created_at", "2021-02-01 01:15:23.244428"], ["updated_at", "2021-02-01 01:15:23.244428"]]
---
    def vote(value)
        vote = Vote.new(value: value)
        vote.user_id = current_user.id
        vote.votable_id = params[:id]
        vote.votable_type = :Post

        vote.save!