redditclone/app/controllers/subs_controller.rb

SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 2]]
---
    def destroy
        @sub = Sub.find_by(id: params[:id])
        @sub.destroy!