redditclone/app/views/posts/new.html.erb

    <br>
    <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"