redditclone/app/views/posts/show.html.erb

SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 3]]
---
<h1><%= @post.title %></h1>
<h2>in <% @post.subs.each do |sub|%>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
---
<ul>
  <% @post.top_level_comments.each do |comment| %>