redditclone/app/models/post.rb

    def comments_by_parent_id
        comments = self.comments.includes(:author)
        all_comments = Hash.new {|key, value| key[value] = []}
        comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]