redditclone/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "targetlover"], ["LIMIT", 1]]
---
    def find_by_credentials(username, password)
        user = User.find_by(username: username)