music_app/app/views/tracks/new.html.erb

    <select type="text" name="track[album_id]" id="album_name">
        <% @album.band.albums.each do |album| %>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 7]]